// Copyright (c) Peter Hillerström (skipifzero.com, peter@hstroem.se)
//
// This software is provided 'as-is', without any express or implied
// warranty. In no event will the authors be held liable for any damages
// arising from the use of this software.
//
// Permission is granted to anyone to use this software for any purpose,
// including commercial applications, and to alter it and redistribute it
// freely, subject to the following restrictions:
//
// 1. The origin of this software must not be misrepresented; you must not
//    claim that you wrote the original software. If you use this software
//    in a product, an acknowledgment in the product documentation would be
//    appreciated but is not required.
// 2. Altered source versions must be plainly marked as such, and must not be
//    misrepresented as being the original software.
// 3. This notice may not be removed or altered from any source distribution.

#ifndef SFZ_H
#define SFZ_H

#if defined(min) || defined(max)
#undef min
#undef max
#endif

// C/C++ compatibility macros
// ------------------------------------------------------------------------------------------------

#ifdef __cplusplus
#define SFZ_EXTERN_C extern "C"
#else
#define SFZ_EXTERN_C
#endif

#ifdef __cplusplus
#define SFZ_NODISCARD [[nodiscard]]
#else
#define SFZ_NODISCARD
#endif

#ifdef __cplusplus
#define sfz_struct(name) struct name final
#else
#define sfz_struct(name) \
	struct name; \
	typedef struct name name; \
	struct name
#endif

#ifdef __cplusplus
#define sfz_constant constexpr
#else
#define sfz_constant static const
#endif


// Scalar primitives
// ------------------------------------------------------------------------------------------------

typedef signed char i8;
typedef signed short i16;
typedef signed int i32;
typedef signed long long i64;

typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned int u32;
typedef unsigned long long u64;

typedef float f32;
typedef double f64;

#ifdef __cplusplus

static_assert(sizeof(i8) == 1, "i8 is wrong size");
static_assert(sizeof(i16) == 2, "i16 is wrong size");
static_assert(sizeof(i32) == 4, "i32 is wrong size");
static_assert(sizeof(i64) == 8, "i64 is wrong size");

static_assert(sizeof(u8) == 1, "u8 is wrong size");
static_assert(sizeof(u16) == 2, "u16 is wrong size");
static_assert(sizeof(u32) == 4, "u32 is wrong size");
static_assert(sizeof(u64) == 8, "u64 is wrong size");

static_assert(sizeof(f32) == 4, "f32 is wrong size");
static_assert(sizeof(f64) == 8, "f64 is wrong size");

namespace sfz {

constexpr i8 min(i8 l, i8 r) { return (l < r) ? l : r; }
constexpr i16 min(i16 l, i16 r) { return (l < r) ? l : r; }
constexpr i32 min(i32 l, i32 r) { return (l < r) ? l : r; }
constexpr i64 min(i64 l, i64 r) { return (l < r) ? l : r; }

constexpr u8 min(u8 l, u8 r) { return (l < r) ? l : r; }
constexpr u16 min(u16 l, u16 r) { return (l < r) ? l : r; }
constexpr u32 min(u32 l, u32 r) { return (l < r) ? l : r; }
constexpr u64 min(u64 l, u64 r) { return (l < r) ? l : r; }

constexpr f32 min(f32 l, f32 r) { return (l < r) ? l : r; }
constexpr f64 min(f64 l, f64 r) { return (l < r) ? l : r; }

constexpr i8 max(i8 l, i8 r) { return (l < r) ? r : l; }
constexpr i16 max(i16 l, i16 r) { return (l < r) ? r : l; }
constexpr i32 max(i32 l, i32 r) { return (l < r) ? r : l; }
constexpr i64 max(i64 l, i64 r) { return (l < r) ? r : l; }

constexpr u8 max(u8 l, u8 r) { return (l < r) ? r : l; }
